tutorials/bayesianOptimization/Bayesian Optimization of chip cooling/chip_cooling_Not_Rotated/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 -0 0);

boundaryField
{
    solid
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    side2
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    side1
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    bottom
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
}


// ************************************************************************* //
